RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_pb_reg.h
/**
  ******************************************************************************
  * @file    osd_pb_reg.h
  * @version V1.0
  * @date    2021-06-28
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __OSD_PB_REG_H__
#define __OSD_PB_REG_H__

#include "bl808.h"

/* 0x000 : osd_pb_ctrl_reg */
#define OSD_PB_CTRL_REG_OFFSET         (0x000)
#define OSD_PB_REG_OSD_PB_LUMA_TH      OSD_PB_REG_OSD_PB_LUMA_TH
#define OSD_PB_REG_OSD_PB_LUMA_TH_POS  (0U)
#define OSD_PB_REG_OSD_PB_LUMA_TH_LEN  (8U)
#define OSD_PB_REG_OSD_PB_LUMA_TH_MSK  (((1U << OSD_PB_REG_OSD_PB_LUMA_TH_LEN) - 1) << OSD_PB_REG_OSD_PB_LUMA_TH_POS)
#define OSD_PB_REG_OSD_PB_LUMA_TH_UMSK (~(((1U << OSD_PB_REG_OSD_PB_LUMA_TH_LEN) - 1) << OSD_PB_REG_OSD_PB_LUMA_TH_POS))
#define OSD_PB_STS_OSD_PB_W_CNT_R      OSD_PB_STS_OSD_PB_W_CNT_R
#define OSD_PB_STS_OSD_PB_W_CNT_R_POS  (8U)
#define OSD_PB_STS_OSD_PB_W_CNT_R_LEN  (5U)
#define OSD_PB_STS_OSD_PB_W_CNT_R_MSK  (((1U << OSD_PB_STS_OSD_PB_W_CNT_R_LEN) - 1) << OSD_PB_STS_OSD_PB_W_CNT_R_POS)
#define OSD_PB_STS_OSD_PB_W_CNT_R_UMSK (~(((1U << OSD_PB_STS_OSD_PB_W_CNT_R_LEN) - 1) << OSD_PB_STS_OSD_PB_W_CNT_R_POS))
#define OSD_PB_STS_OSD_PB_IDX_R        OSD_PB_STS_OSD_PB_IDX_R
#define OSD_PB_STS_OSD_PB_IDX_R_POS    (15U)
#define OSD_PB_STS_OSD_PB_IDX_R_LEN    (1U)
#define OSD_PB_STS_OSD_PB_IDX_R_MSK    (((1U << OSD_PB_STS_OSD_PB_IDX_R_LEN) - 1) << OSD_PB_STS_OSD_PB_IDX_R_POS)
#define OSD_PB_STS_OSD_PB_IDX_R_UMSK   (~(((1U << OSD_PB_STS_OSD_PB_IDX_R_LEN) - 1) << OSD_PB_STS_OSD_PB_IDX_R_POS))

/* 0x004 : osd_pb_result0 */
#define OSD_PB_RESULT0_OFFSET             (0x004)
#define OSD_PB_STS_OSD_PB_RESULT_0_R      OSD_PB_STS_OSD_PB_RESULT_0_R
#define OSD_PB_STS_OSD_PB_RESULT_0_R_POS  (0U)
#define OSD_PB_STS_OSD_PB_RESULT_0_R_LEN  (32U)
#define OSD_PB_STS_OSD_PB_RESULT_0_R_MSK  (((1U << OSD_PB_STS_OSD_PB_RESULT_0_R_LEN) - 1) << OSD_PB_STS_OSD_PB_RESULT_0_R_POS)
#define OSD_PB_STS_OSD_PB_RESULT_0_R_UMSK (~(((1U << OSD_PB_STS_OSD_PB_RESULT_0_R_LEN) - 1) << OSD_PB_STS_OSD_PB_RESULT_0_R_POS))

/* 0x008 : osd_pb_result1 */
#define OSD_PB_RESULT1_OFFSET             (0x008)
#define OSD_PB_STS_OSD_PB_RESULT_1_R      OSD_PB_STS_OSD_PB_RESULT_1_R
#define OSD_PB_STS_OSD_PB_RESULT_1_R_POS  (0U)
#define OSD_PB_STS_OSD_PB_RESULT_1_R_LEN  (32U)
#define OSD_PB_STS_OSD_PB_RESULT_1_R_MSK  (((1U << OSD_PB_STS_OSD_PB_RESULT_1_R_LEN) - 1) << OSD_PB_STS_OSD_PB_RESULT_1_R_POS)
#define OSD_PB_STS_OSD_PB_RESULT_1_R_UMSK (~(((1U << OSD_PB_STS_OSD_PB_RESULT_1_R_LEN) - 1) << OSD_PB_STS_OSD_PB_RESULT_1_R_POS))

/* 0x010 : osd_pb_addr_00 */
#define OSD_PB_ADDR_00_OFFSET       (0x010)
#define OSD_PB_REG_OSD_PB_X_00      OSD_PB_REG_OSD_PB_X_00
#define OSD_PB_REG_OSD_PB_X_00_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_00_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_00_MSK  (((1U << OSD_PB_REG_OSD_PB_X_00_LEN) - 1) << OSD_PB_REG_OSD_PB_X_00_POS)
#define OSD_PB_REG_OSD_PB_X_00_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_00_LEN) - 1) << OSD_PB_REG_OSD_PB_X_00_POS))
#define OSD_PB_REG_OSD_PB_Y_00      OSD_PB_REG_OSD_PB_Y_00
#define OSD_PB_REG_OSD_PB_Y_00_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_00_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_00_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_00_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_00_POS)
#define OSD_PB_REG_OSD_PB_Y_00_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_00_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_00_POS))

/* 0x014 : osd_pb_addr_01 */
#define OSD_PB_ADDR_01_OFFSET       (0x014)
#define OSD_PB_REG_OSD_PB_X_01      OSD_PB_REG_OSD_PB_X_01
#define OSD_PB_REG_OSD_PB_X_01_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_01_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_01_MSK  (((1U << OSD_PB_REG_OSD_PB_X_01_LEN) - 1) << OSD_PB_REG_OSD_PB_X_01_POS)
#define OSD_PB_REG_OSD_PB_X_01_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_01_LEN) - 1) << OSD_PB_REG_OSD_PB_X_01_POS))
#define OSD_PB_REG_OSD_PB_Y_01      OSD_PB_REG_OSD_PB_Y_01
#define OSD_PB_REG_OSD_PB_Y_01_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_01_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_01_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_01_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_01_POS)
#define OSD_PB_REG_OSD_PB_Y_01_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_01_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_01_POS))

/* 0x018 : osd_pb_addr_02 */
#define OSD_PB_ADDR_02_OFFSET       (0x018)
#define OSD_PB_REG_OSD_PB_X_02      OSD_PB_REG_OSD_PB_X_02
#define OSD_PB_REG_OSD_PB_X_02_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_02_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_02_MSK  (((1U << OSD_PB_REG_OSD_PB_X_02_LEN) - 1) << OSD_PB_REG_OSD_PB_X_02_POS)
#define OSD_PB_REG_OSD_PB_X_02_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_02_LEN) - 1) << OSD_PB_REG_OSD_PB_X_02_POS))
#define OSD_PB_REG_OSD_PB_Y_02      OSD_PB_REG_OSD_PB_Y_02
#define OSD_PB_REG_OSD_PB_Y_02_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_02_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_02_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_02_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_02_POS)
#define OSD_PB_REG_OSD_PB_Y_02_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_02_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_02_POS))

/* 0x01C : osd_pb_addr_03 */
#define OSD_PB_ADDR_03_OFFSET       (0x01C)
#define OSD_PB_REG_OSD_PB_X_03      OSD_PB_REG_OSD_PB_X_03
#define OSD_PB_REG_OSD_PB_X_03_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_03_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_03_MSK  (((1U << OSD_PB_REG_OSD_PB_X_03_LEN) - 1) << OSD_PB_REG_OSD_PB_X_03_POS)
#define OSD_PB_REG_OSD_PB_X_03_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_03_LEN) - 1) << OSD_PB_REG_OSD_PB_X_03_POS))
#define OSD_PB_REG_OSD_PB_Y_03      OSD_PB_REG_OSD_PB_Y_03
#define OSD_PB_REG_OSD_PB_Y_03_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_03_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_03_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_03_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_03_POS)
#define OSD_PB_REG_OSD_PB_Y_03_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_03_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_03_POS))

