RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_pb_reg.h
/* 0x060 : osd_pb_addr_14 */
#define OSD_PB_ADDR_14_OFFSET       (0x060)
#define OSD_PB_REG_OSD_PB_X_14      OSD_PB_REG_OSD_PB_X_14
#define OSD_PB_REG_OSD_PB_X_14_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_14_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_14_MSK  (((1U << OSD_PB_REG_OSD_PB_X_14_LEN) - 1) << OSD_PB_REG_OSD_PB_X_14_POS)
#define OSD_PB_REG_OSD_PB_X_14_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_14_LEN) - 1) << OSD_PB_REG_OSD_PB_X_14_POS))
#define OSD_PB_REG_OSD_PB_Y_14      OSD_PB_REG_OSD_PB_Y_14
#define OSD_PB_REG_OSD_PB_Y_14_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_14_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_14_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_14_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_14_POS)
#define OSD_PB_REG_OSD_PB_Y_14_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_14_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_14_POS))

/* 0x064 : osd_pb_addr_15 */
#define OSD_PB_ADDR_15_OFFSET       (0x064)
#define OSD_PB_REG_OSD_PB_X_15      OSD_PB_REG_OSD_PB_X_15
#define OSD_PB_REG_OSD_PB_X_15_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_15_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_15_MSK  (((1U << OSD_PB_REG_OSD_PB_X_15_LEN) - 1) << OSD_PB_REG_OSD_PB_X_15_POS)
#define OSD_PB_REG_OSD_PB_X_15_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_15_LEN) - 1) << OSD_PB_REG_OSD_PB_X_15_POS))
#define OSD_PB_REG_OSD_PB_Y_15      OSD_PB_REG_OSD_PB_Y_15
#define OSD_PB_REG_OSD_PB_Y_15_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_15_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_15_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_15_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_15_POS)
#define OSD_PB_REG_OSD_PB_Y_15_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_15_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_15_POS))

/* 0x068 : osd_pb_addr_16 */
#define OSD_PB_ADDR_16_OFFSET       (0x068)
#define OSD_PB_REG_OSD_PB_X_16      OSD_PB_REG_OSD_PB_X_16
#define OSD_PB_REG_OSD_PB_X_16_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_16_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_16_MSK  (((1U << OSD_PB_REG_OSD_PB_X_16_LEN) - 1) << OSD_PB_REG_OSD_PB_X_16_POS)
#define OSD_PB_REG_OSD_PB_X_16_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_16_LEN) - 1) << OSD_PB_REG_OSD_PB_X_16_POS))
#define OSD_PB_REG_OSD_PB_Y_16      OSD_PB_REG_OSD_PB_Y_16
#define OSD_PB_REG_OSD_PB_Y_16_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_16_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_16_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_16_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_16_POS)
#define OSD_PB_REG_OSD_PB_Y_16_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_16_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_16_POS))

/* 0x06C : osd_pb_addr_17 */
#define OSD_PB_ADDR_17_OFFSET       (0x06C)
#define OSD_PB_REG_OSD_PB_X_17      OSD_PB_REG_OSD_PB_X_17
#define OSD_PB_REG_OSD_PB_X_17_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_17_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_17_MSK  (((1U << OSD_PB_REG_OSD_PB_X_17_LEN) - 1) << OSD_PB_REG_OSD_PB_X_17_POS)
#define OSD_PB_REG_OSD_PB_X_17_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_17_LEN) - 1) << OSD_PB_REG_OSD_PB_X_17_POS))
#define OSD_PB_REG_OSD_PB_Y_17      OSD_PB_REG_OSD_PB_Y_17
#define OSD_PB_REG_OSD_PB_Y_17_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_17_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_17_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_17_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_17_POS)
#define OSD_PB_REG_OSD_PB_Y_17_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_17_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_17_POS))

/* 0x070 : osd_pb_addr_18 */
#define OSD_PB_ADDR_18_OFFSET       (0x070)
#define OSD_PB_REG_OSD_PB_X_18      OSD_PB_REG_OSD_PB_X_18
#define OSD_PB_REG_OSD_PB_X_18_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_18_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_18_MSK  (((1U << OSD_PB_REG_OSD_PB_X_18_LEN) - 1) << OSD_PB_REG_OSD_PB_X_18_POS)
#define OSD_PB_REG_OSD_PB_X_18_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_18_LEN) - 1) << OSD_PB_REG_OSD_PB_X_18_POS))
#define OSD_PB_REG_OSD_PB_Y_18      OSD_PB_REG_OSD_PB_Y_18
#define OSD_PB_REG_OSD_PB_Y_18_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_18_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_18_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_18_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_18_POS)
#define OSD_PB_REG_OSD_PB_Y_18_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_18_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_18_POS))

/* 0x074 : osd_pb_addr_19 */
#define OSD_PB_ADDR_19_OFFSET       (0x074)
#define OSD_PB_REG_OSD_PB_X_19      OSD_PB_REG_OSD_PB_X_19
#define OSD_PB_REG_OSD_PB_X_19_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_19_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_19_MSK  (((1U << OSD_PB_REG_OSD_PB_X_19_LEN) - 1) << OSD_PB_REG_OSD_PB_X_19_POS)
#define OSD_PB_REG_OSD_PB_X_19_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_19_LEN) - 1) << OSD_PB_REG_OSD_PB_X_19_POS))
#define OSD_PB_REG_OSD_PB_Y_19      OSD_PB_REG_OSD_PB_Y_19
#define OSD_PB_REG_OSD_PB_Y_19_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_19_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_19_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_19_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_19_POS)
#define OSD_PB_REG_OSD_PB_Y_19_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_19_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_19_POS))

/* 0x078 : osd_pb_addr_1a */
#define OSD_PB_ADDR_1A_OFFSET       (0x078)
#define OSD_PB_REG_OSD_PB_X_1A      OSD_PB_REG_OSD_PB_X_1A
#define OSD_PB_REG_OSD_PB_X_1A_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1A_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1A_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1A_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1A_POS)
#define OSD_PB_REG_OSD_PB_X_1A_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1A_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1A_POS))
#define OSD_PB_REG_OSD_PB_Y_1A      OSD_PB_REG_OSD_PB_Y_1A
#define OSD_PB_REG_OSD_PB_Y_1A_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1A_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1A_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1A_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1A_POS)
#define OSD_PB_REG_OSD_PB_Y_1A_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1A_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1A_POS))

/* 0x07C : osd_pb_addr_1b */
#define OSD_PB_ADDR_1B_OFFSET       (0x07C)
#define OSD_PB_REG_OSD_PB_X_1B      OSD_PB_REG_OSD_PB_X_1B
#define OSD_PB_REG_OSD_PB_X_1B_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1B_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1B_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1B_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1B_POS)
#define OSD_PB_REG_OSD_PB_X_1B_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1B_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1B_POS))
#define OSD_PB_REG_OSD_PB_Y_1B      OSD_PB_REG_OSD_PB_Y_1B
#define OSD_PB_REG_OSD_PB_Y_1B_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1B_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1B_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1B_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1B_POS)
#define OSD_PB_REG_OSD_PB_Y_1B_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1B_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1B_POS))

/* 0x080 : osd_pb_addr_1c */
#define OSD_PB_ADDR_1C_OFFSET       (0x080)
#define OSD_PB_REG_OSD_PB_X_1C      OSD_PB_REG_OSD_PB_X_1C
#define OSD_PB_REG_OSD_PB_X_1C_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1C_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1C_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1C_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1C_POS)
#define OSD_PB_REG_OSD_PB_X_1C_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1C_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1C_POS))
#define OSD_PB_REG_OSD_PB_Y_1C      OSD_PB_REG_OSD_PB_Y_1C
#define OSD_PB_REG_OSD_PB_Y_1C_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1C_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1C_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1C_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1C_POS)
#define OSD_PB_REG_OSD_PB_Y_1C_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1C_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1C_POS))

/* 0x084 : osd_pb_addr_1d */
#define OSD_PB_ADDR_1D_OFFSET       (0x084)
#define OSD_PB_REG_OSD_PB_X_1D      OSD_PB_REG_OSD_PB_X_1D
#define OSD_PB_REG_OSD_PB_X_1D_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1D_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1D_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1D_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1D_POS)
#define OSD_PB_REG_OSD_PB_X_1D_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1D_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1D_POS))
#define OSD_PB_REG_OSD_PB_Y_1D      OSD_PB_REG_OSD_PB_Y_1D
#define OSD_PB_REG_OSD_PB_Y_1D_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1D_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1D_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1D_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1D_POS)
#define OSD_PB_REG_OSD_PB_Y_1D_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1D_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1D_POS))

/* 0x088 : osd_pb_addr_1e */
#define OSD_PB_ADDR_1E_OFFSET       (0x088)
#define OSD_PB_REG_OSD_PB_X_1E      OSD_PB_REG_OSD_PB_X_1E
#define OSD_PB_REG_OSD_PB_X_1E_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1E_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1E_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1E_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1E_POS)
#define OSD_PB_REG_OSD_PB_X_1E_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1E_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1E_POS))
#define OSD_PB_REG_OSD_PB_Y_1E      OSD_PB_REG_OSD_PB_Y_1E
#define OSD_PB_REG_OSD_PB_Y_1E_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1E_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1E_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1E_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1E_POS)
#define OSD_PB_REG_OSD_PB_Y_1E_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1E_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1E_POS))

/* 0x08C : osd_pb_addr_1f */
#define OSD_PB_ADDR_1F_OFFSET       (0x08C)
#define OSD_PB_REG_OSD_PB_X_1F      OSD_PB_REG_OSD_PB_X_1F
#define OSD_PB_REG_OSD_PB_X_1F_POS  (0U)
#define OSD_PB_REG_OSD_PB_X_1F_LEN  (11U)
#define OSD_PB_REG_OSD_PB_X_1F_MSK  (((1U << OSD_PB_REG_OSD_PB_X_1F_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1F_POS)
#define OSD_PB_REG_OSD_PB_X_1F_UMSK (~(((1U << OSD_PB_REG_OSD_PB_X_1F_LEN) - 1) << OSD_PB_REG_OSD_PB_X_1F_POS))
#define OSD_PB_REG_OSD_PB_Y_1F      OSD_PB_REG_OSD_PB_Y_1F
#define OSD_PB_REG_OSD_PB_Y_1F_POS  (16U)
#define OSD_PB_REG_OSD_PB_Y_1F_LEN  (11U)
#define OSD_PB_REG_OSD_PB_Y_1F_MSK  (((1U << OSD_PB_REG_OSD_PB_Y_1F_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1F_POS)
#define OSD_PB_REG_OSD_PB_Y_1F_UMSK (~(((1U << OSD_PB_REG_OSD_PB_Y_1F_LEN) - 1) << OSD_PB_REG_OSD_PB_Y_1F_POS))

struct osd_pb_reg {
    /* 0x000 : osd_pb_ctrl_reg */
    union {
        struct {
            uint32_t reg_osd_pb_luma_th : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t sts_osd_pb_w_cnt_r : 5;  /* [12: 8],          r,        0x0 */
            uint32_t reserved_13_14     : 2;  /* [14:13],       rsvd,        0x0 */
            uint32_t sts_osd_pb_idx_r   : 1;  /* [   15],          r,        0x0 */
            uint32_t reserved_16_31     : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_ctrl_reg;

    /* 0x004 : osd_pb_result0 */
    union {
        struct {
            uint32_t sts_osd_pb_result_0_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_result0;

    /* 0x008 : osd_pb_result1 */
    union {
        struct {
            uint32_t sts_osd_pb_result_1_r : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_result1;

