RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_pb_reg.h
    /* 0xc  reserved */
    uint8_t RESERVED0xc[4];

    /* 0x010 : osd_pb_addr_00 */
    union {
        struct {
            uint32_t reg_osd_pb_x_00 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_00 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_00;

    /* 0x014 : osd_pb_addr_01 */
    union {
        struct {
            uint32_t reg_osd_pb_x_01 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_01 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_01;

    /* 0x018 : osd_pb_addr_02 */
    union {
        struct {
            uint32_t reg_osd_pb_x_02 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_02 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_02;

    /* 0x01C : osd_pb_addr_03 */
    union {
        struct {
            uint32_t reg_osd_pb_x_03 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_03 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_03;

    /* 0x020 : osd_pb_addr_04 */
    union {
        struct {
            uint32_t reg_osd_pb_x_04 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_04 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_04;

    /* 0x024 : osd_pb_addr_05 */
    union {
        struct {
            uint32_t reg_osd_pb_x_05 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_05 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_05;

    /* 0x028 : osd_pb_addr_06 */
    union {
        struct {
            uint32_t reg_osd_pb_x_06 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_06 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_06;

    /* 0x02C : osd_pb_addr_07 */
    union {
        struct {
            uint32_t reg_osd_pb_x_07 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_07 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_07;

    /* 0x030 : osd_pb_addr_08 */
    union {
        struct {
            uint32_t reg_osd_pb_x_08 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_08 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_08;

    /* 0x034 : osd_pb_addr_09 */
    union {
        struct {
            uint32_t reg_osd_pb_x_09 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_09 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_09;

    /* 0x038 : osd_pb_addr_0a */
    union {
        struct {
            uint32_t reg_osd_pb_x_0a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0a;

    /* 0x03C : osd_pb_addr_0b */
    union {
        struct {
            uint32_t reg_osd_pb_x_0b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0b;

    /* 0x040 : osd_pb_addr_0c */
    union {
        struct {
            uint32_t reg_osd_pb_x_0c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0c;

    /* 0x044 : osd_pb_addr_0d */
    union {
        struct {
            uint32_t reg_osd_pb_x_0d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0d;

    /* 0x048 : osd_pb_addr_0e */
    union {
        struct {
            uint32_t reg_osd_pb_x_0e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0e;

    /* 0x04C : osd_pb_addr_0f */
    union {
        struct {
            uint32_t reg_osd_pb_x_0f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_0f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_0f;

    /* 0x050 : osd_pb_addr_10 */
    union {
        struct {
            uint32_t reg_osd_pb_x_10 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_10 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_10;

    /* 0x054 : osd_pb_addr_11 */
    union {
        struct {
            uint32_t reg_osd_pb_x_11 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_11 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_11;

    /* 0x058 : osd_pb_addr_12 */
    union {
        struct {
            uint32_t reg_osd_pb_x_12 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_12 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_12;

    /* 0x05C : osd_pb_addr_13 */
    union {
        struct {
            uint32_t reg_osd_pb_x_13 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_13 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_13;

