RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_pb_reg.h
    /* 0x060 : osd_pb_addr_14 */
    union {
        struct {
            uint32_t reg_osd_pb_x_14 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_14 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_14;

    /* 0x064 : osd_pb_addr_15 */
    union {
        struct {
            uint32_t reg_osd_pb_x_15 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_15 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_15;

    /* 0x068 : osd_pb_addr_16 */
    union {
        struct {
            uint32_t reg_osd_pb_x_16 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_16 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_16;

    /* 0x06C : osd_pb_addr_17 */
    union {
        struct {
            uint32_t reg_osd_pb_x_17 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_17 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_17;

    /* 0x070 : osd_pb_addr_18 */
    union {
        struct {
            uint32_t reg_osd_pb_x_18 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_18 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_18;

    /* 0x074 : osd_pb_addr_19 */
    union {
        struct {
            uint32_t reg_osd_pb_x_19 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_19 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_19;

    /* 0x078 : osd_pb_addr_1a */
    union {
        struct {
            uint32_t reg_osd_pb_x_1a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1a;

    /* 0x07C : osd_pb_addr_1b */
    union {
        struct {
            uint32_t reg_osd_pb_x_1b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1b;

    /* 0x080 : osd_pb_addr_1c */
    union {
        struct {
            uint32_t reg_osd_pb_x_1c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1c;

    /* 0x084 : osd_pb_addr_1d */
    union {
        struct {
            uint32_t reg_osd_pb_x_1d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1d;

    /* 0x088 : osd_pb_addr_1e */
    union {
        struct {
            uint32_t reg_osd_pb_x_1e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1e;

    /* 0x08C : osd_pb_addr_1f */
    union {
        struct {
            uint32_t reg_osd_pb_x_1f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_osd_pb_y_1f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } osd_pb_addr_1f;
};

typedef volatile struct osd_pb_reg osd_pb_reg_t;

#endif /* __OSD_PB_REG_H__ */
